# Built In Failures Electrical Failures Number Of Circuit Full For Connection Change Property

Source: https://www.revitapidocs.com/2026/d474e383-ce33-50a1-f19d-42c1ea5d15b7.htm

---

| Built In Failures Electrical Failures Number Of Circuit Full For Connection Change Property |
| --- |

You can't change the connection type to Breakers and connect to switchboard \[Panel Name] because there aren't enough space. \\nYou can increase the number of circuits to be greater than \[Number] to connect through breakers.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static FailureDefinitionId NumberOfCircuitFullForConnectionChange { get; }
```

```
Public Shared ReadOnly Property NumberOfCircuitFullForConnectionChange As FailureDefinitionId
	Get
```

```
public:
static property FailureDefinitionId^ NumberOfCircuitFullForConnectionChange {
	FailureDefinitionId^ get ();
}
```

```
static member NumberOfCircuitFullForConnectionChange : FailureDefinitionId with get
```

#### Property Value

FailureDefinitionId See Also

#### Reference

BuiltInFailures ElectricalFailures Class Autodesk.Revit.DB Namespace